"use strict";

/*1․ ստեղծում եք ցանկացած թեմատիկային փոքր կոնսոլային հավելված, որը չպետք ա կախում
ունենա բրաուզերից / +
2․ ձեր կոնսոլային հավելվածի մեջ օգտագործում եք հետևյալ մեթոդները՝ toUpperCase, 
toLowerCase, +slice, trim, split, join, +forEach
3. +աշխատացնում եք console-ում 
Հ․Գ․ +ցանկալի ա կոնսոլում ֆունկցիա գրվի, արգումենտ փոխանցվի, ու ըստ էդ արգումենտի 
կատարվեն ներքին մեխանիզմները :)*/ 

const tour = {
	infoAboutCountry:["ԿԻպրոս", "Բուլղարիա", "Եգիպտոս", "Թունիս", "Արաբական Միացյալ Էմիրություններ"],
	cyprus:{
		nameCountry_1: "Կիպրոս",
		aboutVisa_1:"C տեսակի վիզա է անհրաժեշտ է այն քաղաքացիներին, ովքեր պատրաստվում են այցելել տվյալ երկիր տուրիստական, գործնական, գիտական, սպորտային նպատակներով, ինչպես նաև կարճաժամկետ ուսումնական նպատակով, հարազատներին այցելելու և, անհրաժոշտության դեպքում, տարանցիկ նպատակով տեղաշարժվելու համար:D տեսակի երկարաժամկետ  վիզա է տրվում միայն մեկ մուտքի համար և հնարավորություն է տալիս մնալ այնտեղ 6 ամսվա ընթացքում մինչև 180 օր։ Այս տեսակի վիզան տրվում է մուտքի հետևյալ նպատակների համար՝ գործարարություն, ընտանիքի վերամիավորում, մշակութային գործունեություն, կրթություն, աշխատանք։Հյուպատոսական վճարը 15000 դրամ է։",
		sightseeing_1:["Կատո Պաֆոսի հնագիտական ​​այգի", "Կորիոն","Թագավորական դամբարան"],
	    toursWithAirTicket_1:{
			june: "1100 եվրոյին համարժեք դրամ",
			july: "1500 եվրոյին համարժեք դրամ",
			august: "1700 եվրոյին համարժեք դրամ"
		}
	},
    bulgaria:{
		nameCountry_2: "Բուլղարիա",
		aboutVisa_2:"C տեսակի վիզա է անհրաժեշտ է այն քաղաքացիներին, ովքեր պատրաստվում են այցելել տվյալ երկիր տուրիստական, գործնական, գիտական, սպորտային նպատակներով, ինչպես նաև կարճաժամկետ ուսումնական նպատակով, հարազատներին այցելելու և, անհրաժոշտության դեպքում, տարանցիկ նպատակով տեղաշարժվելու համար:D տեսակի երկարաժամկետ  վիզա է տրվում միայն մեկ մուտքի համար և հնարավորություն է տալիս մնալ այնտեղ 6 ամսվա ընթացքում մինչև 180 օր։ Այս տեսակի վիզան տրվում է մուտքի հետևյալ նպատակների համար՝ գործարարություն, ընտանիքի վերամիավորում, մշակութային գործունեություն, կրթություն, աշխատանք։ Դեսպանատան վճարը 35 եվրո է։",
        sightseeing_2:["Սերդիկա հնագույն ամրոց", "Նեսեբարի հնագիտական ​​թանգարան", "Եվքսինոգրադ"],
		toursWithAirTicket_2:{
			june: "500 եվրոյին համարժեք դրամ",
			july: "550 եվրոյին համարժեք դրամ",
			august: "700 եվրոյին համարժեք դրամ"
			}
	},
	egypt:{
	    nameCountry_3:"Եգիպտոս",
		aboutVisa_3:"Եգիպտոսի վիզա ստանալու տարբեր պայմաններ են գործում ՀՀ քաղաքացիների համար:Շարմ Էլ Շեյխ մեկնող ՀՀ քաղաքացիներին մուտքի արտոնագիր անհրաժեշտ չէ մինչև 14 օր կեցության դեպքում։ Սինայի դրոշմ-ն (Синайский Штамп) անվճար է, և կարելի է ճամփորդել միայն Շարմ Էլ Շեյխ և Թաբա քաղաքների միջև ընկած հատվածում:Հուրգադա մեկնող ՀՀ քաղաքացիները վիզա ստանում են Հուրգադայի օդանավակայանում՝ արժեքը 1 անձի համար՝ 25$։Կահիրե մեկնելու դեպքում. եթե ՀՀ քաղաքացիները Կահիրե են մեկնում համակցված թռիչքով՝ Շարմ Էլ Շեյխից կամ Հուրգադայից, ապա կարող են մուտքի արտոնագիր ստանալ հենց օդանավակայանում՝ վճարելով 25$, հակառակ դեպքում Կահիրե մեկնելուց առաջ անհրաժեշտ է վիզայի համար դիմել ՀՀ-ում Եգիպտոսի դեսպանություն։ Մուտքի արտոնագրի արժեքը՝ 25$:Անձնագրի վավերականության ժամկետը պետք է լինի 6 ամսից ոչ պակաս՝ վերադարձի օրվանից հաշված:",
        sightseeing_3:["Գիզայի բուրգեր", "Փարավոնների հովիտ", "Լուքսորի տաճար"],
		toursWithAirTicket_3:{
			june: "350 եվրոյին համարժեք դրամ",
			july: "400 եվրոյին համարժեք դրամ",
			august: "450 եվրոյին համարժեք դրամ"
			}
	},
	tunisia:{
		nameCountry_4: "Թունիս",
		aboutVisa_4:"ՀՀ քաղաքացիները Թունիսի մուտքի թույլտվություն ստանալու համար կարող են դիմել Մոսկվայում գտնվող Թունիսի դեսպանատուն։Ձեր անձնագրերը պետք է վավերացվեն առնվազն վեց ամսով, երբ մուտք եք գործում Թունիս: Դուք կստանաք նամականիշ ձեր երկրում մուտքագրվելիս ձեր անձնագրին (համոզվեք, որ դուք ստանում եք), որը թույլ կտա ձեզ մնալ 3 ամիս: Մուտքի վճար չի գանձվում:Դեսպանատան վճարը 5000 ռուսական ռուբլի է։",
        sightseeing_4:["հնագույն Կարթագեն քաղաք", "Ամֆիթատրոն Էլ Ջեմում", "Սիդի Բու Սաիդ քաղաք"],
		toursWithAirTicket_4:{
			june: "600 եվրոյին համարժեք դրամ",
			july: "700 եվրոյին համարժեք դրամ",
			august: "750 եվրոյին համարժեք դրամ"
			}
	},
	UAE:{
        nameCountry_5: "Արաբական Միացյալ Էմիրություններ",
		aboutVisa_5:"Կախված այցի  տևողություից և նպատակից՝ ՀՀ քաղաքացիներին ԱՄԷ վիզան կարող է տրամադրվել առցանց կամ Հայաստանում ԱՄԷ-ի միգրացիոն ծառայության կողմից։ Մեկ մուտքի վիզա(30 օրով) արժե 120$, մեկ մուտքի վիզա(90 օրով) - 300$, բազմակի մուտքի վիզա(90 օրով) - 600$:",
        sightseeing_5:["Բուրջ Խալիֆա", "Արմավենու կղզիներ", "ԱՄԷ-ի նախագահական պալատ"],
		toursWithAirTicket_5:{
			june: "450 եվրոյին համարժեք դրամ",
			july: "400 եվրոյին համարժեք դրամ",
			august: "350 եվրոյին համարժեք դրամ"
			}
	},
	SightSeeingForTour:function(country){
        if(country === "Կիպրոս"){
          console.log(`Տուրի ընթացքում կայցելենք Կիպրոսի տեսարժան վայրեր՝ ${tour.cyprus.sightseeing_1[0]}ն, ${tour.cyprus.sightseeing_1[1]}ը և ${tour.cyprus.sightseeing_1[2]}ը:`);
	   } 
	   else if(country === "Բուլղարիա"){
		  console.log(`Տուրի ընթացքում կայցելենք Բուլղարիայի տեսարժան վայրեր՝ ${tour.bulgaria.sightseeing_2[0]}ը, ${tour.bulgaria.sightseeing_2[1]}ը և ${tour.bulgaria.sightseeing_2[2]}:`);
	   } 
	   else if(country === "Եգիպտոս"){
		console.log(`Տուրի ընթացքում կայցելենք Եգիպտոսի տեսարժան վայրեր՝ ${tour.egypt.sightseeing_3[0]}ը, ${tour.egypt.sightseeing_3[1]}ը և ${tour.egypt.sightseeing_3[2]}:`);
	   } 
	   else if(country === "Թունիս"){
		console.log(`Տուրի ընթացքում կայցելենք Թունիսի տեսարժան վայրեր՝ ${tour.tunisia.sightseeing_4[0]}ը, ${tour.tunisia.sightseeing_4[1]}ը և ${tour.tunisia.sightseeing_4[2]}:`);
	   } 
	   else{
		console.log(`Տուրի ընթացքում կայցելենք ԱՄԷ-ի տեսարժան վայրեր՝ ${tour.UAE.sightseeing_5[0]}, ${tour.UAE.sightseeing_5[1]}ը և ${tour.UAE.sightseeing_5[2]}:`);
	   }
	},
	HowMuchTour:function(country,month){
        if(country === "Կիպրոս" && month === "հունիս"){
           console.log(`Տուրի արժեքն է ${tour.cyprus.toursWithAirTicket_1.june}:`);
	    } 
		else if(country === "Կիպրոս" && month === "հուլիս"){
		   console.log(`Տուրի արժեքն է ${tour.cyprus.toursWithAirTicket_1.july}:`);
	    } 
		else if(country === "Կիպրոս" && month === "օգոստոս"){
		  console.log(`Տուրի արժեքն է ${tour.cyprus.toursWithAirTicket_1.august}:`);
	    }
        else if(country === "Բուլղարիա" && month === "հունիս"){
			console.log(`Տուրի արժեքն է ${tour.bulgaria.toursWithAirTicket_2.june}:`);
		}
		else if(country === "Բուլղարիա" && month === "հուլիս"){
			console.log(`Տուրի արժեքն է ${tour.bulgaria.toursWithAirTicket_2.july}:`);
		}  
		else if(country === "Բուլղարիա" && month === "օգոստոս"){
			console.log(`Տուրի արժեքն է ${tour.bulgaria.toursWithAirTicket_2.august}:`);
		}
		else if(country === "Եգիպտոս" && month === "հունիս"){
			console.log(`Տուրի արժեքն է ${tour.egypt.toursWithAirTicket_3.june}:`);
		}
		else if(country === "Եգիպտոս" && month === "հուլիս"){
			console.log(`Տուրի արժեքն է ${tour.egypt.toursWithAirTicket_3.july}:`);
		}
		else if(country === "Եգիպտոս" && month === "օգոստոս"){
			console.log(`Տուրի արժեքն է ${tour.egypt.toursWithAirTicket_3.august}:`);
		}
		else if(country === "Թունիս" && month === "հունիս"){
			console.log(`Տուրի արժեքն է ${tour.tunisia.toursWithAirTicket_4.june}:`);
		}
		else if(country === "Թունիս" && month === "հուլիս"){
			console.log(`Տուրի արժեքն է ${tour.tunisia.toursWithAirTicket_4.july}:`);
		}
		else if(country === "Թունիս" && month === "օգոստոս"){
			console.log(`Տուրի արժեքն է ${tour.tunisia.toursWithAirTicket_4.august}:`);
		}
		else if(country === "ԱՄԷ" | country === "Արաբական Միացյալ Էմիրություններ" && month === "հունիս"){
			console.log(`Տուրի արժեքն է ${tour.UAE.toursWithAirTicket_5.june}:`);
		}
		else if(country === "ԱՄԷ" || country === "Արաբական Միացյալ Էմիրություններ" && month === "հուլիս"){
			console.log(`Տուրի արժեքն է ${tour.UAE.toursWithAirTicket_5.july}:`);
		}
		else{
			console.log(`Տուրի արժեքն է ${tour.UAE.toursWithAirTicket_5.august}:`);
		}
	},
	aboutVisaFee:function(country){
		if(country === "Կիպրոս"){
			console.log(tour.cyprus.aboutVisa_1.slice(558,591));
		} 
		else if(country === "Բուլղարիա"){
			console.log(tour.bulgaria.aboutVisa_2.slice(559,586));
		}
		else if(country === "Եգիպտոս"){
            console.log(tour.egypt.aboutVisa_3.slice(680,709));
		}
		else if(country === "Թունիս"){
            console.log(tour.tunisia.aboutVisa_4.slice(345));
		}
		else if(country === "ԱՄԷ"){
		console.log(tour.UAE.aboutVisa_5.slice(143));
	    } else{
			console.log("Մենք տվյալ երկիր տուրեր չունենք։");
		}
    },
	info(want){
		if(want === "Ինչ տուրեր ունեք" || want === "Տուրեր" || want === "Որտեղ գնամ" || want === "Որտեղ գնամ հանգստանամ"){
			tour.infoAboutCountry.forEach(function(country){
			  console.log(country);
			});
		}
	}			
};

//tour.info("Ինչ տուրեր ունեք");
//tour.aboutVisaFee("Կիպրոս");
//tour.SightSeeingForTour("Կիպրոս");
//tour.HowMuchTour("Կիպրոս","օգոստոս");

